## Plan Result (main)

[CI link](https://github.com/Shion1305/Shion1305-infra/actions/runs/18856302635)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.oci_compute_instance-k8s.oci_core_instance.this



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.oci_compute_instance-k8s.oci_core_instance.this must be replaced
-/+ resource "oci_core_instance" "this" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.ap-tokyo-1.abxhiljrswccex2cmpst2j7lz6hckewh2o5u35flmsnx4xkmohxt52llqn5q" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/shion1305@gmail.com"
          - "Oracle-Tags.CreatedOn" = "2025-06-15T17:46:33.655Z"
        } -> (known after apply)
      ~ extended_metadata                   = {} -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      ~ hostname_label                      = "instance-2024-1" -> (known after apply)
      ~ id                                  = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycqrbpmpg5ljs6qo33hcfmcll3kbdoukpdbhtoeify2syq" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.ap-tokyo-1.aaaaaaaax3arbzsjtoqovmp56hfba3q2qyxljbci6ejkuagmkjql6ej3mj6q" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ private_ip                          = "10.0.0.20" -> (known after apply)
      ~ public_ip                           = "152.70.103.93" -> (known after apply)
      ~ region                              = "ap-tokyo-1" -> (known after apply)
      ~ security_attributes                 = {} -> (known after apply)
      ~ security_attributes_state           = "STABLE" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2025-06-15 17:46:34.059 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (7 unchanged attributes hidden)

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/shion1305@gmail.com"
              - "Oracle-Tags.CreatedOn" = "2025-06-15T17:46:33.727Z"
            } -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          ~ private_ip                = "10.0.0.20" -> "10.0.7.20" # forces replacement
          ~ security_attributes       = {} -> (known after apply)
          + vlan_id                   = (known after apply)
            # (7 unchanged attributes hidden)

          ~ ipv6address_ipv6subnet_cidr_pair_details {
              + assign_ipv6ip             = (known after apply)
              + assign_private_dns_record = (known after apply)
              + assign_public_ip          = (known after apply)
              + defined_tags              = (known after apply)
              + display_name              = (known after apply)
              + freeform_tags             = (known after apply)
              + hostname_label            = (known after apply)
              + nsg_ids                   = (known after apply)
              + private_ip                = (known after apply)
              + security_attributes       = (known after apply)
              + skip_source_dest_check    = (known after apply)
              + subnet_id                 = (known after apply)
              + vlan_id                   = (known after apply)
            } -> (known after apply)
        }

      ~ instance_options {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ launch_options {
          ~ is_pv_encryption_in_transit_enabled = false -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      ~ launch_volume_attachments {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ licensing_configs {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ placement_constraint_details {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ platform_config {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ preemptible_instance_config {
          + async                                   = (known after apply)
          + availability_domain                     = (known after apply)
          + boot_volume_id                          = (known after apply)
          + capacity_reservation_id                 = (known after apply)
          + cluster_placement_group_id              = (known after apply)
          + compartment_id                          = (known after apply)
          + compute_cluster_id                      = (known after apply)
          + dedicated_vm_host_id                    = (known after apply)
          + defined_tags                            = (known after apply)
          + display_name                            = (known after apply)
          + extended_metadata                       = (known after apply)
          + fault_domain                            = (known after apply)
          + freeform_tags                           = (known after apply)
          + hostname_label                          = (known after apply)
          + id                                      = (known after apply)
          + image                                   = (known after apply)
          + instance_configuration_id               = (known after apply)
          + ipxe_script                             = (known after apply)
          + is_cross_numa_node                      = (known after apply)
          + is_pv_encryption_in_transit_enabled     = (known after apply)
          + launch_mode                             = (known after apply)
          + metadata                                = (known after apply)
          + preserve_boot_volume                    = (known after apply)
          + preserve_data_volumes_created_at_launch = (known after apply)
          + private_ip                              = (known after apply)
          + public_ip                               = (known after apply)
          + region                                  = (known after apply)
          + security_attributes                     = (known after apply)
          + security_attributes_state               = (known after apply)
          + shape                                   = (known after apply)
          + state                                   = (known after apply)
          + subnet_id                               = (known after apply)
          + system_tags                             = (known after apply)
          + time_created                            = (known after apply)
          + time_maintenance_reboot_due             = (known after apply)
          + update_operation_constraint             = (known after apply)
        } -> (known after apply)

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 3 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 3 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
          ~ vcpus                         = 3 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"run-terragrunt-plan","PRNumber":50,"Program":"tfcmt","SHA1":"490bd2dada48fc057a95b107fb207abaa260ea35","Target":"main","Vars":{},"WorkflowName":"Run Plan on OCI"} -->